Revit 2024 API
ParameterTypeId.FasciaProfileParam Property
 "Profile"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId FasciaProfileParam { get; }
Visual Basic
Public Shared ReadOnly Property FasciaProfileParam As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ FasciaProfileParam {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace